routes/app/controllers/artworks_controller.rb

    def show
        incoming_wildcard = params[:id]
        artwork = Artwork.find(incoming_wildcard)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]