routes/app/controllers/users_controller.rb

    def show
        incoming_wildcard = params[:id]
        user = User.find(incoming_wildcard)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update

        user = User.find_by(id: params[:id])
        if user && user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Alexa"], ["updated_at", "2023-03-09 00:59:47.700400"], ["id", 1]]

    def destroy
        user = User.find_by(id: params[:id])
        if user && user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]