routes/app/models/artwork.rb

    def self.artworks_for_user_id(user_id)
        completed_artworks = Artwork.where(artist_id: user_id).select('*')
        shared_artworks = ArtworkShare.joins(:artwork).where(viewer_id: user_id).select('artworks.*')
---
SELECT "artworks"."id" FROM "artworks" WHERE "artworks"."artist_id" IS NULL
SELECT artworks.* FROM "artwork_shares" INNER JOIN "artworks" ON "artworks"."id" = "artwork_shares"."artwork_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 31]]