routes/app/models/artwork.rb

SELECT * FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 31]]
---
    def self.artworks_for_user_id(user_id)
        completed_artworks = Artwork.where(artist_id: incoming_wildcard)
        shared_artworks = ArtworkShare.where(viewer_id: incoming_wildcard)